/** @file etpwm.h
*   @brief ETPWM Driver Header File
*   @date 22.June.2012
*   @version 03.02.00
*   
*   This file contains:
*   - Definitions
*   - Types
*   - Interface Prototypes
*   .
*   which are relevant for the ETPWM driver.
*/

/* (c) Texas Instruments 2009-2012, All rights reserved. */

#ifndef __ETPWM_H__
#define __ETPWM_H__

// **************************************************************************
// the includes

#include "sys_common.h"


//!
//! \defgroup ETPWM

//!
//! \ingroup ETPWM
//@{


#ifdef __cplusplus
extern "C" {
#endif


// **************************************************************************
// the defines


//! \brief Defines the base address of the pulse width modulation (ETPWM) 1 registers
//!
#define ETPWM_ETPWM1_BASE_ADDR          (0x00006800)

//! \brief Defines the base address of the pulse width modulation (ETPWM) 2 registers
//!
#define ETPWM_ETPWM2_BASE_ADDR          (0x00006840)

//! \brief Defines the base address of the pulse width modulation (ETPWM) 3 registers
//!
#define ETPWM_ETPWM3_BASE_ADDR          (0x00006880)

//! \brief Defines the base address of the pulse width modulation (ETPWM) 4 registers
//!
#define ETPWM_ETPWM4_BASE_ADDR          (0x000068C0)

//! \brief Defines the base address of the pulse width modulation (ETPWM) 5 registers
//!
#define ETPWM_ETPWM5_BASE_ADDR          (0x00006900)

//! \brief Defines the base address of the pulse width modulation (ETPWM) 6 registers
//!

} ETPWM_ShadowMode_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) shadow status options
//!
typedef enum
{
  ETPWM_ShadowStatus_NotFull=0,
  ETPWM_ShadowStatus_Full
} ETPWM_ShadowStatus_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) start of conversion (SOC) period options
//!
typedef enum
{
  ETPWM_SocPeriod_Disable=0,
  ETPWM_SocPeriod_FirstEvent,
  ETPWM_SocPeriod_SecondEvent,
  ETPWM_SocPeriod_ThirdEvent
} ETPWM_SocPeriod_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) start of conversion (SOC) sources
//!
typedef enum
{
  ETPWM_SocPulseSrc_DcEvt=0,
  ETPWM_SocPulseSrc_CounterEqualZero,
  ETPWM_SocPulseSrc_CounterEqualPeriod,
  ETPWM_SocPulseSrc_CounterEqualZeroOrPeriod,
  ETPWM_SocPulseSrc_CounterEqualCmpAIncr,
  ETPWM_SocPulseSrc_CounterEqualCmpADecr,
  ETPWM_SocPulseSrc_CounterEqualCmpBIncr,
  ETPWM_SocPulseSrc_CounterEqualCmpBDecr
} ETPWM_SocPulseSrc_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) sync modes
//!
typedef enum
{
  ETPWM_SyncMode_ETPWMxSYNC=(0 << 4),
  ETPWM_SyncMode_CounterEqualZero=(1 << 4),
  ETPWM_SyncMode_CounterEqualCounterCompareZero=(2 << 4),
  ETPWM_SyncMode_Disable=(3 << 4)
} ETPWM_SyncMode_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) trip zone sources
//!
typedef enum
{
  ETPWM_TripZoneSrc_CycleByCycle_TZ1_NOT=(1 << 0),
  ETPWM_TripZoneSrc_CycleByCycle_TZ2_NOT=(1 << 1),
  ETPWM_TripZoneSrc_CycleByCycle_TZ3_NOT=(1 << 2),
  ETPWM_TripZoneSrc_CycleByCycle_TZ4_NOT=(1 << 3),
  ETPWM_TripZoneSrc_CycleByCycle_TZ5_NOT=(1 << 4),
  ETPWM_TripZoneSrc_CycleByCycle_TZ6_NOT=(1 << 5),
  ETPWM_TripZoneSrc_CycleByCycle_CmpA=(1 << 6),
  ETPWM_TripZoneSrc_CycleByCycle_CmpB=(1 << 7),
  ETPWM_TripZoneSrc_OneShot_TZ1_NOT=(1 << 8),
  ETPWM_TripZoneSrc_OneShot_TZ2_NOT=(1 << 9),
  ETPWM_TripZoneSrc_OneShot_TZ3_NOT=(1 << 10),
  ETPWM_TripZoneSrc_OneShot_TZ4_NOT=(1 << 11),
  ETPWM_TripZoneSrc_OneShot_TZ5_NOT=(1 << 12),
  ETPWM_TripZoneSrc_OneShot_TZ6_NOT=(1 << 13),
  ETPWM_TripZoneSrc_OneShot_CmpA=(1 << 14),
  ETPWM_TripZoneSrc_OneShot_CmpB=(1 << 15)
} ETPWM_TripZoneSrc_e;


//! \brief Enumeration to define the pulse width modulation (ETPWM) trip zone states
//!
typedef enum
{
  ETPWM_TripZoneState_HighImp=0,
  ETPWM_TripZoneState_ETPWM_High,
  ETPWM_TripZoneState_ETPWM_Low,
  ETPWM_TripZoneState_DoNothing
} ETPWM_TripZoneState_e;


typedef enum
{
  NO_EVENT=0,
  CTR_ZERO=1,
  CTR_PRD=2,
  CTR_ZERO_PRD=3,
  CTR_UP_CMPA=4,
  CTR_D0WM_CMPA=5,
  CTR_UP_CMPB=6,
  CTR_D0WM_CMPB=7
} ETPWM_Event_e;

typedef enum
{
  DCAEVT1=0,
  DCBEVT1=0
} ETPWM_DCEvent_e;

typedef enum
{
  PWMA_RED_FED=0,
  PWMA_FED_PWMB_RED=1,
  PWMA_RED_PWMB_FED=2,
  PWMB_RED_FED=3
} ETPWM_DeadBandInput_e;

typedef enum
{
  PWMA_PWMB_NIL=0,
  PWMA_NIL_PWMB_FED=1,
  PWMA_RED_PWMB_NIL=2,
  PWMB_FED_PWMA_RED=3
} ETPWM_DeadBandOutput_e;

//! \brief Defines the pulse width modulation (ETPWM) object
//!

#if ((__little_endian__ == 1) || (__LITTLE_ENDIAN__ == 1)) 

typedef struct _etpwmBASE_t_
{

    uint16_t TBCTL;           /**<  0x0000 Time-Base Control Register*/
    uint16_t TBSTS;           /**<  0x0002 Time-Base Status Register*/
    uint16_t TBPHSHR;         /**<  0x0004 Extension for HRPWM Phase Register*/
    uint16_t TBPHS;           /**<  0x0006 Time-Base Phase Register*/
    uint16_t TBCTR;           /**<  0x0008 Time-Base Counter Register*/
    uint16_t TBPRD;           /**<  0x000A Time-Base Period Register*/
    uint16_t TBPRDHR;         /**<  0x000C Time Base Period High Resolution Register*/
    uint16_t CMPCTL;          /**<  0x000E Counter-Compare Control Register*/
    uint16_t CMPAHR;          /**<  0x0010 Extension for HRPWM Counter-Compare A Register*/
    uint16_t CMPA;            /**<  0x0012 Counter-Compare A Register*/
    uint16_t CMPB;            /**<  0x0014 Counter-Compare B Register*/
    uint16_t AQCTLA;          /**<  0x0016 Action-Qualifier Control Register for Output A (ETPWMxA)*/
    uint16_t AQCTLB;          /**<  0x0018 Action-Qualifier Control Register for Output B (ETPWMxB)*/
    uint16_t AQSFRC;          /**<  0x001A Action-Qualifier Software Force Register*/
    uint16_t AQCSFRC;         /**<  0x001C Action-Qualifier Continuous S/W Force Register Set*/
    uint16_t DBCTL;           /**<  0x001E Dead-Band Generator Control Register*/
    uint16_t DBRED;           /**<  0x0020 Dead-Band Generator Rising Edge Delay Count Register*/
    uint16_t DBFED;           /**<  0x0022 Dead-Band Generator Falling Edge Delay Count Register*/
    uint16_t TZSEL;           /**<  0x0024 Trip-Zone Select Register*/
    uint16_t TZDCSEL;         /**<  0x0026 Trip Zone Digital Compare Select Register*/
    uint16_t TZCTL;           /**<  0x0028 Trip-Zone Control Register*/
    uint16_t TZEINT;          /**<  0x002A Trip-Zone Enable Interrupt Register*/
    uint16_t TZFLG;           /**<  0x002C Trip-Zone Flag Register*/
    uint16_t TZCLR;           /**<  0x002E Trip-Zone Clear Register*/
    uint16_t TZFRC;           /**<  0x0030 Trip-Zone Force Register*/
    uint16_t ETSEL;           /**<  0x0032 Event-Trigger Selection Register*/
    uint16_t ETPS;            /**<  0x0034 Event-Trigger Pre-Scale Register*/
    uint16_t ETFLG;           /**<  0x0036 Event-Trigger Flag Register*/
    uint16_t ETCLR;           /**<  0x0038 Event-Trigger Clear Register*/
    uint16_t ETFRC;           /**<  0x003A Event-Trigger Force Register*/
    uint16_t PCCTL;           /**<  0x003C PWM-Chopper Control Register*/
    uint16_t   rsvd_1;        /**<  0x003C Reserved*/
    uint16_t HRCNFG;          /**<  0x003E HRPWM Configuration Register*/
    uint16_t HRPWR;           /**<  0x0040 HRPWM Power Register*/
    uint16_t   rsvd_2;        /**<  0x0042 Reserved*/
    uint16_t   rsvd_3;        /**<  0x0044 Reserved*/
    uint16_t   rsvd_4;        /**<  0x0046 Reserved*/
    uint16_t   rsvd_5;        /**<  0x0048 Reserved*/
    uint16_t HRMSTEP;         /**<  0x004A HRPWM MEP Step Register*/
    uint16_t   rsvd_6;        /**<  0x004C Reserved*/
    uint16_t HRPCTL;          /**<  0x004E High Resolution Period Control Register*/
    uint16_t   rsvd_7;        /**<  0x0050 Reserved*/
    uint16_t TBPRDHRM;        /**<  0x0052 Time Base Period High Resolution Register Mirror*/
    uint16_t TBPRDM;          /**<  0x0054 Time Base Period Register Mirror*/
    uint16_t CMPAHRM;         /**<  0x0056 Compare A High Resolution Register Mirror*/
    uint16_t CMPAM;           /**<  0x0058 Compare A Register Mirror*/
    uint16_t DCTRIPSEL;       /**<  0x005A Digital Compare Trip Select Register*/
    uint16_t DCACTL;          /**<  0x005C Digital Compare A Control Register*/
    uint16_t DCBCTL;          /**<  0x005E Digital Compare B Control Register*/
    uint16_t DCFCTL;          /**<  0x0060 Digital Compare Filter Control Register*/
    uint16_t DCCAPCTL;        /**<  0x0062 Digital Compare Capture Control Register*/
    uint16_t DCFOFFSET;       /**<  0x0064 Digital Compare Filter Offset Register*/
    uint16_t DCFOFFSETCNT;    /**<  0x0066 Digital Compare Filter Offset Counter Register*/
    uint16_t DCFWINDOW;       /**<  0x0068 Digital Compare Filter Window Register*/
    uint16_t DCFWINDOWCNT;    /**<  0x006A Digital Compare Filter Window Counter Register*/
    uint16_t DCCAP;           /**<  0x006C Digital Compare Counter Capture Register*/

} etpwmBASE_t;

#else

typedef struct _etpwmBASE_t_
{

    uint16_t TBSTS;           /**<  0x0002 Time-Base Status Register*/
    uint16_t TBCTL;           /**<  0x0000 Time-Base Control Register*/
    uint16_t TBPHS;           /**<  0x0006 Time-Base Phase Register*/
    uint16_t TBPHSHR;         /**<  0x0004 Extension for HRPWM Phase Register*/
    uint16_t TBPRD;           /**<  0x000A Time-Base Period Register*/
    uint16_t TBCTR;           /**<  0x0008 Time-Base Counter Register*/
    uint16_t CMPCTL;          /**<  0x000E Counter-Compare Control Register*/
    uint16_t TBPRDHR;         /**<  0x000C Time Base Period High Resolution Register*/
    uint16_t CMPA;            /**<  0x0012 Counter-Compare A Register*/
    uint16_t CMPAHR;          /**<  0x0010 Extension for HRPWM Counter-Compare A Register*/
    uint16_t AQCTLA;          /**<  0x0016 Action-Qualifier Control Register for Output A (ETPWMxA)*/
    uint16_t CMPB;            /**<  0x0014 Counter-Compare B Register*/
    uint16_t AQSFRC;          /**<  0x001A Action-Qualifier Software Force Register*/
    uint16_t AQCTLB;          /**<  0x0018 Action-Qualifier Control Register for Output B (EETPWMxB)*/
    uint16_t DBCTL;           /**<  0x001E Dead-Band Generator Control Register*/
    uint16_t AQCSFRC;         /**<  0x001C Action-Qualifier Continuous S/W Force Register Set*/
    uint16_t DBFED;           /**<  0x0022 Dead-Band Generator Falling Edge Delay Count Register*/
    uint16_t DBRED;           /**<  0x0020 Dead-Band Generator Rising Edge Delay Count Register*/
    uint16_t TZDCSEL;         /**<  0x0026 Trip Zone Digital Compare Select Register*/
    uint16_t TZSEL;           /**<  0x0024 Trip-Zone Select Register*/
    uint16_t TZEINT;          /**<  0x002A Trip-Zone Enable Interrupt Register*/
    uint16_t TZCTL;           /**<  0x0028 Trip-Zone Control Register*/
    uint16_t TZCLR;           /**<  0x002E Trip-Zone Clear Register*/
    uint16_t TZFLG;           /**<  0x002C Trip-Zone Flag Register*/
    uint16_t ETSEL;           /**<  0x0032 Event-Trigger Selection Register*/
    uint16_t TZFRC;           /**<  0x0030 Trip-Zone Force Register*/
    uint16_t ETFLG;           /**<  0x0036 Event-Trigger Flag Register*/
    uint16_t ETPS;            /**<  0x0034 Event-Trigger Pre-Scale Register*/
    uint16_t ETFRC;           /**<  0x003A Event-Trigger Force Register*/
    uint16_t ETCLR;           /**<  0x0038 Event-Trigger Clear Register*/
    uint16_t   rsvd_1;        /**<  0x003C Reserved*/
    uint16_t PCCTL;           /**<  0x003C PWM-Chopper Control Register*/
    uint16_t HRPWR;           /**<  0x0040 HRPWM Power Register*/
    uint16_t HRCNFG;          /**<  0x003E HRPWM Configuration Register*/
    uint16_t   rsvd_3;        /**<  0x0044 Reserved*/
    uint16_t   rsvd_2;        /**<  0x0042 Reserved*/
    uint16_t   rsvd_5;        /**<  0x0048 Reserved*/
    uint16_t   rsvd_4;        /**<  0x0046 Reserved*/
    uint16_t   rsvd_6;        /**<  0x004C Reserved*/
    uint16_t HRMSTEP;         /**<  0x004A HRPWM MEP Step Register*/
    uint16_t   rsvd_7;        /**<  0x0050 Reserved*/
    uint16_t HRPCTL;          /**<  0x004E High Resolution Period Control Register*/
    uint16_t TBPRDM;          /**<  0x0054 Time Base Period Register Mirror*/
    uint16_t TBPRDHRM;        /**<  0x0052 Time Base Period High Resolution Register Mirror*/
    uint16_t CMPAM;           /**<  0x0058 Compare A Register Mirror*/
    uint16_t CMPAHRM;         /**<  0x0056 Compare A High Resolution Register Mirror*/
    uint16_t DCACTL;          /**<  0x005C Digital Compare A Control Register*/
    uint16_t DCTRIPSEL;       /**<  0x005A Digital Compare Trip Select Register*/
    uint16_t DCFCTL;          /**<  0x0060 Digital Compare Filter Control Register*/
    uint16_t DCBCTL;          /**<  0x005E Digital Compare B Control Register*/
    uint16_t DCFOFFSET;       /**<  0x0064 Digital Compare Filter Offset Register*/
    uint16_t DCCAPCTL;        /**<  0x0062 Digital Compare Capture Control Register*/
    uint16_t DCFWINDOW;       /**<  0x0068 Digital Compare Filter Window Register*/
    uint16_t DCFOFFSETCNT;    /**<  0x0066 Digital Compare Filter Offset Counter Register*/
    uint16_t DCCAP;           /**<  0x006C Digital Compare Counter Capture Register*/
    uint16_t DCFWINDOWCNT;    /**<  0x006A Digital Compare Filter Window Counter Register*/

} etpwmBASE_t;

#endif



/** @def etpwmREG1
*   @brief ETPWM1 Register Frame Pointer
*
*   This pointer is used by the ETPWM driver to access the ETPWM1 registers.
*/
#define etpwmREG1 ((etpwmBASE_t *)0xFCF78C00U)

/** @def etpwmREG2
*   @brief ETPWM2 Register Frame Pointer
*
*   This pointer is used by the ETPWM driver to access the ETPWM2 registers.
*/
#define etpwmREG2 ((etpwmBASE_t *)0xFCF78D00U)

/** @def etpwmREG3
*   @brief ETPWM3 Register Frame Pointer
*
*   This pointer is used by the ETPWM driver to access the ETPWM3 registers.
*/
#define etpwmREG3 ((etpwmBASE_t *)0xFCF78E00U)

/** @def etpwmREG4
*   @brief ETPWM4 Register Frame Pointer
*
*   This pointer is used by the ETPWM driver to access the ETPWM4 registers.
*/
#define etpwmREG4 ((etpwmBASE_t *)0xFCF78F00U)

/** @def etpwmREG5
*   @brief ETPWM5 Register Frame Pointer
*
