/** @file pinmux.h 
*   @brief PINMUX Driver Implementation File
*   @date 15.Mar.2012
*   @version 03.01.00
*
*/

/* (c) Texas Instruments 2009-2012, All rights reserved. */

#include "sys_common.h"

#ifndef __PINMUX_H__
#define __PINMUX_H__

#define PINMUX_BALL_A4_SHIFT    0
#define PINMUX_BALL_A5_SHIFT    8
#define PINMUX_BALL_A11_SHIFT   8
#define PINMUX_BALL_A14_SHIFT   0
#define PINMUX_BALL_B2_SHIFT    24
#define PINMUX_BALL_B3_SHIFT    8
#define PINMUX_BALL_B4_SHIFT    16
#define PINMUX_BALL_B5_SHIFT    24
#define PINMUX_BALL_B11_SHIFT   8
#define PINMUX_BALL_B12_SHIFT   0
#define PINMUX_BALL_C1_SHIFT    0
#define PINMUX_BALL_C2_SHIFT    0
#define PINMUX_BALL_C3_SHIFT    16
#define PINMUX_BALL_C4_SHIFT    16
#define PINMUX_BALL_C5_SHIFT    8
#define PINMUX_BALL_C6_SHIFT    0
#define PINMUX_BALL_D3_SHIFT    0
#define PINMUX_BALL_D4_SHIFT    0
#define PINMUX_BALL_D5_SHIFT    0
#define PINMUX_BALL_D16_SHIFT   24
#define PINMUX_BALL_D17_SHIFT   16
#define PINMUX_BALL_D19_SHIFT   0
#define PINMUX_BALL_E1_SHIFT    16
#define PINMUX_BALL_E3_SHIFT    8
#define PINMUX_BALL_E18_SHIFT   0
#define PINMUX_BALL_E19_SHIFT   0
#define PINMUX_BALL_F3_SHIFT    16
#define PINMUX_BALL_G3_SHIFT    8
#define PINMUX_BALL_G19_SHIFT   16
#define PINMUX_BALL_H3_SHIFT    16
#define PINMUX_BALL_H18_SHIFT   24
#define PINMUX_BALL_H19_SHIFT   16
#define PINMUX_BALL_J1_SHIFT    8
#define PINMUX_BALL_J3_SHIFT    24
#define PINMUX_BALL_J18_SHIFT   0
#define PINMUX_BALL_J19_SHIFT   8

#define PINMUX_ETPWM2_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM2_SHIFT)
#define PINMUX_ETPWM3_EQEPERR12                                   (0x1 <<  PINMUX_ETPWM3_SHIFT)
#define PINMUX_ETPWM3_EQEPERR1                                    (0x2 <<  PINMUX_ETPWM3_SHIFT)
#define PINMUX_ETPWM3_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM3_SHIFT)
#define PINMUX_ETPWM4_EQEPERR12                                   (0x1 <<  PINMUX_ETPWM4_SHIFT)
#define PINMUX_ETPWM4_EQEPERR1                                    (0x2 <<  PINMUX_ETPWM4_SHIFT)
#define PINMUX_ETPWM4_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM4_SHIFT)
#define PINMUX_ETPWM5_EQEPERR12                                   (0x1 <<  PINMUX_ETPWM5_SHIFT)
#define PINMUX_ETPWM5_EQEPERR1                                    (0x2 <<  PINMUX_ETPWM5_SHIFT)
#define PINMUX_ETPWM5_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM5_SHIFT)
#define PINMUX_ETPWM6_EQEPERR12                                   (0x1 <<  PINMUX_ETPWM6_SHIFT)
#define PINMUX_ETPWM6_EQEPERR1                                    (0x2 <<  PINMUX_ETPWM6_SHIFT)
#define PINMUX_ETPWM6_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM6_SHIFT)
#define PINMUX_ETPWM7_EQEPERR12                                   (0x1 <<  PINMUX_ETPWM7_SHIFT)
#define PINMUX_ETPWM7_EQEPERR1                                    (0x2 <<  PINMUX_ETPWM7_SHIFT)
#define PINMUX_ETPWM7_EQEPERR2                                    (0x4 <<  PINMUX_ETPWM7_SHIFT)
#define PINMUX_ETPWM_TIME_BASE_SYNC                        (0x2 <<  PINMUX_ETPWM_TIME_BASE_SYNC_SHIFT)
#define PINMUX_ETPWM_TBCLK_SYNC                            (0x2 <<  PINMUX_ETPWM_TBCLK_SYNC_SHIFT)
#define PINMUX_TZ1_ASYNC                                          (0x1 <<  PINMUX_TZ1_SHIFT)
#define PINMUX_TZ1_SYNC                                           (0x2 <<  PINMUX_TZ1_SHIFT)
#define PINMUX_TZ1_FILTERED                                       (0x4 <<  PINMUX_TZ1_SHIFT)
#define PINMUX_TZ2_ASYNC                                          (0x1 <<  PINMUX_TZ2_SHIFT)
#define PINMUX_TZ2_SYNC                                           (0x2 <<  PINMUX_TZ2_SHIFT)
#define PINMUX_TZ2_FILTERED                                       (0x4 <<  PINMUX_TZ2_SHIFT)
#define PINMUX_TZ3_ASYNC                                          (0x1 <<  PINMUX_TZ3_SHIFT)
#define PINMUX_TZ3_SYNC                                           (0x2 <<  PINMUX_TZ3_SHIFT)
#define PINMUX_TZ3_FILTERED                                       (0x4 <<  PINMUX_TZ3_SHIFT)
#define PINMUX_EPWM1SYNCI_ASYNC                                   (0x1 <<  PINMUX_EPWM1SYNCI_SHIFT)
#define PINMUX_EPWM1SYNCI_SYNC                                    (0x2 <<  PINMUX_EPWM1SYNCI_SHIFT)
#define PINMUX_EPWM1SYNCI_FILTERED                                (0x4 <<  PINMUX_EPWM1SYNCI_SHIFT)



/** @struct pinMuxKicker
*   @brief Pin Muxing Kicker Register Definition
*
*   This structure is used to access the Pin Muxing Kicker registers.
*/
typedef volatile struct pinMuxKicker
{
    uint32_t KICKER0;       /* kicker 0 register */
    uint32_t KICKER1;       /* kicker 1 register */
} pinMuxKICKER_t;

/** @struct pinMuxBase
*   @brief PINMUX Register Definition
*
*   This structure is used to access the PINMUX module egisters.
*/
/** @typedef pinMuxBASE_t
*   @brief PINMUX Register Frame Type Definition
*
*   This type is used to access the PINMUX Registers.
*/
typedef volatile struct pinMuxBase
{
    uint32_t PINMUX0;           /**< 0xEB10 Pin Mux 0 register*/
    uint32_t PINMUX1;           /**< 0xEB14 Pin Mux 1 register*/
    uint32_t PINMUX2;           /**< 0xEB18 Pin Mux 2 register*/
    uint32_t PINMUX3;           /**< 0xEB1C Pin Mux 3 register*/
    uint32_t PINMUX4;           /**< 0xEB20 Pin Mux 4 register*/
    uint32_t PINMUX5;           /**< 0xEB24 Pin Mux 5 register*/
    uint32_t PINMUX6;           /**< 0xEB28 Pin Mux 6 register*/
    uint32_t PINMUX7;           /**< 0xEB2C Pin Mux 7 register*/
    uint32_t PINMUX8;           /**< 0xEB30 Pin Mux 8 register*/
    uint32_t PINMUX9;           /**< 0xEB34 Pin Mux 9 register*/
    uint32_t PINMUX10;          /**< 0xEB38 Pin Mux 10 register*/
    uint32_t PINMUX11;          /**< 0xEB3C Pin Mux 11 register*/
    uint32_t PINMUX12;          /**< 0xEB40 Pin Mux 12 register*/
    uint32_t PINMUX13;          /**< 0xEB44 Pin Mux 13 register*/
    uint32_t PINMUX14;          /**< 0xEB48 Pin Mux 14 register*/
    uint32_t PINMUX15;          /**< 0xEB4C Pin Mux 15 register*/
    uint32_t PINMUX16;          /**< 0xEB50 Pin Mux 16 register*/
    uint32_t PINMUX17;          /**< 0xEB54 Pin Mux 17 register*/
    uint32_t PINMUX18;          /**< 0xEB58 Pin Mux 18 register*/
    uint32_t PINMUX19;          /**< 0xEB5C Pin Mux 19 register*/
    uint32_t PINMUX20;          /**< 0xEB60 Pin Mux 20 register*/
    uint32_t PINMUX21;          /**< 0xEB64 Pin Mux 21 register*/
    uint32_t PINMUX22;          /**< 0xEB68 Pin Mux 22 register*/
    uint32_t PINMUX23;          /**< 0xEB6C Pin Mux 23 register*/
    uint32_t PINMUX24;          /**< 0xEB70 Pin Mux 24 register*/
    uint32_t PINMUX25;          /**< 0xEB74 Pin Mux 25 register*/
    uint32_t PINMUX26;          /**< 0xEB78 Pin Mux 26 register*/
    uint32_t PINMUX27;          /**< 0xEB7C Pin Mux 27 register*/
    uint32_t PINMUX28;          /**< 0xEB80 Pin Mux 28 register*/
    uint32_t PINMUX29;          /**< 0xEB84 Pin Mux 29 register*/
    uint32_t PINMUX30;          /**< 0xEB88 Pin Mux 30 register*/
    uint32_t PINMUX31;          /**< 0xEB8C Pin Mux 31 register*/
    uint32_t PINMUX32;          /**< 0xEB90 Pin Mux 32 register*/
    uint32_t PINMUX33;          /**< 0xEB94 Pin Mux 33 register*/
    uint32_t PINMUX34;          /**< 0xEB98 Pin Mux 34 register*/
    uint32_t PINMUX35;          /**< 0xEB9C Pin Mux 35 register*/
    uint32_t PINMUX36;          /**< 0xEBA0 Pin Mux 36 register*/
    uint32_t PINMUX37;          /**< 0xEBA4 Pin Mux 37 register*/
    uint32_t PINMUX38;          /**< 0xEBA8 Pin Mux 38 register*/
    uint32_t PINMUX39;          /**< 0xEBAC Pin Mux 39 register*/
    uint32_t PINMUX40;          /**< 0xEBB0 Pin Mux 40 register*/
    uint32_t PINMUX41;          /**< 0xEBB4 Pin Mux 41 register*/
    uint32_t PINMUX42;          /**< 0xEBB8 Pin Mux 42 register*/
    uint32_t PINMUX43;          /**< 0xEBBC Pin Mux 43 register*/
    uint32_t PINMUX44;          /**< 0xEBC0 Pin Mux 44 register*/
    uint32_t PINMUX45;          /**< 0xEBC4 Pin Mux 45 register*/
    uint32_t PINMUX46;          /**< 0xEBC8 Pin Mux 46 register*/
    uint32_t PINMUX47;          /**< 0xEBCC Pin Mux 47 register*/

}pinMuxBASE_t;

        
/** @def kickerReg
*       @brief Pin Muxing Kicker Register Frame Pointer
*
*               This pointer is used to enable and disable muxing accross the device.
*/      
#define kickerReg ((pinMuxKICKER_t *) 0xFFFFEA38)

/** @def pinMuxReg
*       @brief Pin Muxing Control Register Frame Pointer
*
*               This pointer is used to set the muxing registers accross the device.
*/      
#define pinMuxReg ((pinMuxBASE_t *) 0xFFFFEB10)

/** @fn void muxInit(void)
*   @brief Initializes the PINMUX Driver
*
*   This function initializes the PINMUX module and configures the selected 
*   pinmux settings as per the user selection in the GUI
*/
void muxInit(void);

#endif
